tome9111991/ESP32-S3_Project/ESP32-8048S043C/KlipperCryptoWeatherPanel/KlipperCryptoWeatherPanel.ino
#include <WiFi.h>
#include <WiFiClient.h>
#include <WiFiClientSecure.h>
#include <HTTPClient.h>
#include <StreamString.h>
#include <time.h>
#include <math.h>
#include <stdlib.h>
#include <string.h>
#include <esp_heap_caps.h>
#include <esp_lcd_panel_ops.h>
#include <esp_lcd_panel_rgb.h>
#include <esp_system.h>
#include <freertos/FreeRTOS.h>
#include <freertos/semphr.h>
#include <Wire.h>

#if __has_include(<esp_arduino_version.h>)
  #include <esp_arduino_version.h>
#endif

#ifndef ESP_ARDUINO_VERSION_MAJOR
  #define ESP_ARDUINO_VERSION_MAJOR 3
#endif

#define LV_CONF_INCLUDE_SIMPLE
#include <lvgl.h>
#include "ui_assets.h"
#include "ui_font_price_digits.h"
#include "ui_font_time_digits.h"

// Compatibility for generated LVGL assets/fonts.
#ifndef LV_ATTRIBUTE_LARGE_CONST
  #define LV_ATTRIBUTE_LARGE_CONST
#endif

#include <ArduinoJson.h>

#ifndef RGB565
  #define RGB565(r, g, b) ((((r) & 0xF8) << 8) | (((g) & 0xFC) << 3) | ((b) >> 3))
#endif

static HardwareSerial& DebugSerial = Serial0;
#define Serial DebugSerial

static constexpr int LCD_W = 800;
static constexpr int LCD_H = 480;
static constexpr int LCD_BL = 2;
static constexpr bool LCD_BL_ACTIVE_HIGH = true;
static constexpr int LCD_BL_PWM_FREQ_HZ = 250;
static constexpr int LCD_BL_PWM_RESOLUTION_BITS = 8;
static constexpr uint32_t LCD_BL_PWM_MAX_DUTY = 255;
static constexpr uint32_t LCD_BL_PWM_MIN_VISIBLE_DUTY = 12;
static constexpr int LCD_BL_PWM_CHANNEL = 0;
static constexpr int LCD_PCLK_HZ = 14000000;
static constexpr int LCD_BOUNCE_LINES = 10;
static constexpr bool LCD_ROTATE_180 = true;
static constexpr int UI_LOGICAL_W = LCD_W;
static constexpr int UI_LOGICAL_H = LCD_H;
static constexpr int UI_OFFSET_X = (LCD_W - UI_LOGICAL_W) / 2;
static constexpr int UI_OFFSET_Y = (LCD_H - UI_LOGICAL_H) / 2;

static esp_lcd_panel_handle_t panel = nullptr;
static SemaphoreHandle_t colorDoneSem = nullptr;
static lv_display_t* lvDisplay = nullptr;
static lv_color_t* lvDrawBuf = nullptr;
static uint32_t lvDrawBufBytes = 0;
static bool lvDrawBufFullMode = false;
static volatile uint32_t lvFlushCount = 0;
static volatile uint32_t lvFlushTimeoutCount = 0;
static volatile uint32_t lvFlushErrorCount = 0;
static bool backlightPwmReady = false;

static uint32_t backlightDutyForBrightness(uint8_t brightness) {
  uint32_t duty = 0;
  if (brightness > 0) {
    duty = LCD_BL_PWM_MIN_VISIBLE_DUTY +
      (((uint32_t)brightness * (LCD_BL_PWM_MAX_DUTY - LCD_BL_PWM_MIN_VISIBLE_DUTY)) / 255U);
  }
  if (!LCD_BL_ACTIVE_HIGH) {
    duty = LCD_BL_PWM_MAX_DUTY - duty;
  }
  return duty;
}

static bool initBacklightPwm(uint8_t initialBrightness) {
  const uint32_t duty = backlightDutyForBrightness(initialBrightness);

#if ESP_ARDUINO_VERSION_MAJOR >= 3
  if (!ledcAttach(LCD_BL, LCD_BL_PWM_FREQ_HZ, LCD_BL_PWM_RESOLUTION_BITS)) {
    Serial.println("Backlight PWM Init fehlgeschlagen");
    return false;
  }
  ledcWrite(LCD_BL, duty);
#else
  ledcSetup(LCD_BL_PWM_CHANNEL, LCD_BL_PWM_FREQ_HZ, LCD_BL_PWM_RESOLUTION_BITS);
  ledcAttachPin(LCD_BL, LCD_BL_PWM_CHANNEL);
  ledcWrite(LCD_BL_PWM_CHANNEL, duty);
#endif
  return true;
}

static void writeBacklightLevel(uint8_t brightness) {
  if (!backlightPwmReady) {
    return;
  }

  const uint32_t duty = backlightDutyForBrightness(brightness);
#if ESP_ARDUINO_VERSION_MAJOR >= 3
  ledcWrite(LCD_BL, duty);
#else
  ledcWrite(LCD_BL_PWM_CHANNEL, duty);
#endif
}

static bool IRAM_ATTR onColorTransferDone(esp_lcd_panel_handle_t, const esp_lcd_rgb_panel_event_data_t*, void*) {
  BaseType_t highTaskWoken = pdFALSE;
  if (colorDoneSem != nullptr) {
    xSemaphoreGiveFromISR(colorDoneSem, &highTaskWoken);
  }
  return highTaskWoken == pdTRUE;
}

static bool initBoardDisplay() {
  colorDoneSem = xSemaphoreCreateBinary();
  if (colorDoneSem == nullptr) {
    Serial.println("Display Semaphore Init fehlgeschlagen!");
    return false;
  }

  esp_lcd_rgb_panel_config_t cfg = {};
  cfg.clk_src = LCD_CLK_SRC_DEFAULT;
  cfg.timings.pclk_hz = LCD_PCLK_HZ;
  cfg.timings.h_res = LCD_W;
  cfg.timings.v_res = LCD_H;
  cfg.timings.hsync_pulse_width = 4;
  cfg.timings.hsync_back_porch = 16;
  cfg.timings.hsync_front_porch = 8;
  cfg.timings.vsync_pulse_width = 4;
  cfg.timings.vsync_back_porch = 4;
  cfg.timings.vsync_front_porch = 4;
  cfg.timings.flags.hsync_idle_low = 1;
  cfg.timings.flags.vsync_idle_low = 1;
  cfg.timings.flags.de_idle_high = 0;
  cfg.timings.flags.pclk_active_neg = 1;
  cfg.timings.flags.pclk_idle_high = 1;
  cfg.data_width = 16;
  cfg.bits_per_pixel = 16;
  cfg.num_fbs = 2;
  cfg.bounce_buffer_size_px = LCD_W * LCD_BOUNCE_LINES;
  cfg.sram_trans_align = 8;
  cfg.psram_trans_align = 64;
  cfg.hsync_gpio_num = 39;
  cfg.vsync_gpio_num = 41;
  cfg.de_gpio_num = 40;
  cfg.pclk_gpio_num = 42;
  cfg.disp_gpio_num = GPIO_NUM_NC;
  cfg.data_gpio_nums[0] = 8;   // B0
  cfg.data_gpio_nums[1] = 3;   // B1
  cfg.data_gpio_nums[2] = 46;  // B2
  cfg.data_gpio_nums[3] = 9;   // B3
  cfg.data_gpio_nums[4] = 1;   // B4
  cfg.data_gpio_nums[5] = 5;   // G0
  cfg.data_gpio_nums[6] = 6;   // G1
  cfg.data_gpio_nums[7] = 7;   // G2
  cfg.data_gpio_nums[8] = 15;  // G3
  cfg.data_gpio_nums[9] = 16;  // G4
  cfg.data_gpio_nums[10] = 4;  // G5
  cfg.data_gpio_nums[11] = 45; // R0
  cfg.data_gpio_nums[12] = 48; // R1
  cfg.data_gpio_nums[13] = 47; // R2
  cfg.data_gpio_nums[14] = 21; // R3
  cfg.data_gpio_nums[15] = 14; // R4
  cfg.flags.disp_active_low = true;
  cfg.flags.refresh_on_demand = false;
  cfg.flags.fb_in_psram = true;
  cfg.flags.double_fb = false;
  cfg.flags.no_fb = false;
  cfg.flags.bb_invalidate_cache = false;

  esp_err_t err = esp_lcd_new_rgb_panel(&cfg, &panel);
  if (err != ESP_OK) {
    Serial.printf("esp_lcd_new_rgb_panel fehlgeschlagen: 0x%X\n", err);
    return false;
  }

  esp_lcd_rgb_panel_event_callbacks_t callbacks = {};
  callbacks.on_color_trans_done = onColorTransferDone;
  err = esp_lcd_rgb_panel_register_event_callbacks(panel, &callbacks, nullptr);
  if (err != ESP_OK) {
    Serial.printf("esp_lcd_rgb_panel_register_event_callbacks fehlgeschlagen: 0x%X\n", err);
    return false;
  }

  err = esp_lcd_panel_reset(panel);
  if (err != ESP_OK) {
    Serial.printf("esp_lcd_panel_reset fehlgeschlagen: 0x%X\n", err);
    return false;
  }

  err = esp_lcd_panel_init(panel);
  if (err != ESP_OK) {
    Serial.printf("esp_lcd_panel_init fehlgeschlagen: 0x%X\n", err);
    return false;
  }

  if (LCD_ROTATE_180) {
    err = esp_lcd_panel_mirror(panel, true, true);
    if (err != ESP_OK) {
      Serial.printf("esp_lcd_panel_mirror fehlgeschlagen: 0x%X\n", err);
    }
  }

  esp_lcd_panel_disp_on_off(panel, true);
  pinMode(LCD_BL, OUTPUT);
  digitalWrite(LCD_BL, LCD_BL_ACTIVE_HIGH ? HIGH : LOW);
  backlightPwmReady = initBacklightPwm(255);
  return true;
}

const uint32_t COLOR_BG = 0x0c0f14;
const uint32_t COLOR_TEXT = 0xeef2f7;
const uint32_t COLOR_MUTED = 0x8490a0;
const uint32_t COLOR_DIM = 0x4e5868;
const uint32_t COLOR_CYAN = 0x5dd6ff;
const uint32_t COLOR_BTC = 0xf7931a;
const uint32_t COLOR_GREEN = 0x2ee59d;
const uint32_t COLOR_LOSS = 0xff5d6c;
const uint32_t COLOR_RED = 0xff0000;
const uint32_t COLOR_ORANGE = 0xffa500;
const uint32_t COLOR_SUN = 0xffd166;
const uint32_t COLOR_MOON = 0xf4f8ff;
const uint32_t COLOR_CLOUD = 0xaeb8c5;
const uint32_t COLOR_RAIN = 0x58c8ff;
const uint32_t COLOR_FOG = 0x6f7b8d;
const char* TEMP_UNIT = " \xc2\xb0""C";
const char* WEEKDAYS_DE[] = {
  "Sonntag", "Montag", "Dienstag", "Mittwoch", "Donnerstag", "Freitag", "Samstag"
};

