tome9111991/ESP32-S3_Project/ESP32-8048S043C/KlipperCryptoWeatherPanel/KlipperCryptoWeatherPanel.ino
// --- KONFIGURATION ---
#include "config_private.h"

#ifndef WIFI_SSID
  #error "WIFI_SSID fehlt. Kopiere config_private.example.h nach config_private.h und trage deine Daten ein."
#endif
#ifndef WIFI_PASSWORD
  #error "WIFI_PASSWORD fehlt. Kopiere config_private.example.h nach config_private.h und trage deine Daten ein."
#endif
#ifndef LOCATION_LATITUDE
  #error "LOCATION_LATITUDE fehlt. Kopiere config_private.example.h nach config_private.h und trage deine Daten ein."
#endif
#ifndef LOCATION_LONGITUDE
  #error "LOCATION_LONGITUDE fehlt. Kopiere config_private.example.h nach config_private.h und trage deine Daten ein."
#endif
#ifndef TIMEZONE_POSIX
  #error "TIMEZONE_POSIX fehlt. Kopiere config_private.example.h nach config_private.h und trage deine Zeitzone ein."
#endif
#ifndef CRYPTO_BASE_SYMBOL
  #define CRYPTO_BASE_SYMBOL "BTC"
#endif
#ifndef CRYPTO_QUOTE_SYMBOL
  #define CRYPTO_QUOTE_SYMBOL "USD"
#endif
#ifndef CRYPTO_PRICE_PREFIX
  #define CRYPTO_PRICE_PREFIX ""
#endif
#ifndef CRYPTO_SERVICE_NAME
  #define CRYPTO_SERVICE_NAME "COINBASE"
#endif
#ifndef KLIPPER_BASE_URL
  #define KLIPPER_BASE_URL "http://mainsail"
#endif

const char* ssid = WIFI_SSID;
const char* password = WIFI_PASSWORD;

// Bright Sky liefert DWD-Daten ohne API-Key.
const float locationLatitude = LOCATION_LATITUDE;
const float locationLongitude = LOCATION_LONGITUDE;
const char* timezonePosix = TIMEZONE_POSIX;
// Coinbase Crypto-Paar. Fuer SOL/EUR z.B. cryptoBaseSymbol="SOL", cryptoQuoteSymbol="EUR".
const char* cryptoBaseSymbol = CRYPTO_BASE_SYMBOL;
const char* cryptoQuoteSymbol = CRYPTO_QUOTE_SYMBOL;
const char* cryptoPricePrefix = CRYPTO_PRICE_PREFIX; // leer = automatisch: USD/EUR/GBP/JPY/BTC Symbol, sonst Quote-Code
const char* cryptoServiceName = CRYPTO_SERVICE_NAME;
const char* klipperBaseUrl = KLIPPER_BASE_URL;
const unsigned long btcRefreshInterval = 60000; // 60 Sekunden
const unsigned long btcRetryInterval = 30000; // 30 Sekunden bei Fehlern
const unsigned long btcCandleRefreshInterval = 300000; // 5 Minuten
const unsigned long btcCandleRetryInterval = 60000; // 60 Sekunden bei Fehlern
const unsigned long weatherRefreshInterval = 300000; // 5 Minuten
const unsigned long weatherRetryInterval = 120000; // 2 Minuten bei Fehlern
const unsigned long klipperRefreshInterval = 7000; // 7 Sekunden
const unsigned long klipperRetryInterval = 30000; // 30 Sekunden bei Fehlern
const unsigned long klipperNameRefreshInterval = 300000; // 5 Minuten
const unsigned long klipperNameRetryInterval = 120000; // 2 Minuten bei Fehlern
const uint32_t BTC_CANDLE_SECONDS = 86400; // Tageskerzen
const int WEATHER_ICON_W = 93;
const int WEATHER_ICON_H = 80;
const int DIVIDER_H = 4;
const int TIME_SECOND_BAR_W = 360;
const int MMU_GATE_MAX = 8;

// --- GLOBALE VARIABLEN (Thread-Safe) ---
SemaphoreHandle_t dataMutex;
SemaphoreHandle_t networkMutex;
TaskHandle_t fetchTaskHandle = NULL;
String currentBtcPrice = "Laden...";
float currentBtcLivePrice = 0.0f;
int currentBtcPriceDirection = 0;
String currentBtcStatus = String(cryptoServiceName) + " " + cryptoQuoteSymbol;
String btcDayChange = "1D --";
String btcDayRange = "H --  L --";
String btcDayVolume = "VOL --";
String btcCandleStatus = "CANDLE --";
String currentTemp = "--";
String weatherStatus = "WETTER: --";
String weatherLocation = "DWD Station";
int weatherCode = -1;
bool klipperAvailable = false;
bool klipperHostAvailable = false;
String klipperConnectionState = "--";
String klipperConnectionMessage = "";
String klipperState = "--";
String klipperFile = "Kein Job";
String klipperProgress = "--";
String klipperNozzle = "--";
String klipperBed = "--";
String klipperDuration = "--";
String klipperStatus = "KLIPPER --";
String klipperDisplayMessage = "";
String klipperPrinterName = "KLIPPER";
String klipperMetadataFilename = "";
float klipperEstimatedDurationSeconds = 0.0f;
unsigned long klipperMetadataRetryAfter = 0;
bool klipperMmuAvailable = false;
String klipperMmuInfo = "MMU --";
int klipperMmuTool = -1;
int klipperMmuGate = -1;
int klipperMmuGateCount = 0;
uint32_t klipperMmuGateColors[MMU_GATE_MAX] = {
  COLOR_DIM, COLOR_DIM, COLOR_DIM, COLOR_DIM,
  COLOR_DIM, COLOR_DIM, COLOR_DIM, COLOR_DIM
};
int klipperMmuGateStatus[MMU_GATE_MAX] = {
  -1, -1, -1, -1, -1, -1, -1, -1
};
volatile bool wifiConnected = false;
bool timeConfigured = false;
volatile unsigned long wifiConnectedSince = 0;
bool internetAvailable = false;
unsigned long lastInternetProbe = 0;
unsigned long lastWifiReconnectAttempt = 0;
const unsigned long wifiReconnectInterval = 10000;
const unsigned long wifiConnectAttemptTimeout = 30000;
const unsigned long wifiStableBeforeFetchInterval = 8000;
const unsigned long apiRequestGapInterval = 1500;
const unsigned long internetProbeRetryInterval = 30000;
unsigned long lastHealthLog = 0;
const unsigned long healthLogInterval = 60000;
const uint32_t fetchTaskStackSize = 24576;
const UBaseType_t fetchTaskPriority = 1;
// Auf diesem Setup nicht auf Core 0 legen: dort laufen WLAN/TCPIP-Anteile und IDLE0-WDT.
const BaseType_t fetchTaskCore = 1;

struct BtcCandle {
  uint32_t time;
  float low;
  float high;
  float open;
  float close;
  float volume;
};

const int BTC_CANDLE_CAPACITY = 300;
const int BTC_DAY_CANDLE_COUNT = 90; // 90 Tageskerzen
const int BTC_CHART_W = 720;
const int BTC_CHART_H = 250;
const int BTC_CHART_CANVAS_H = 264;
const int BTC_CHART_PROGRESS_Y = 258;
const int BTC_CHART_PROGRESS_H = 5;
BtcCandle* btcCandles = nullptr;
BtcCandle* parsedBtcCandles = nullptr;
BtcCandle* chartBtcCandles = nullptr;
bool btcCandleStorageInPsram = false;
bool parsedBtcCandleStorageInPsram = false;
bool chartBtcCandleStorageInPsram = false;
int btcCandleCount = 0;
float btcDayChangePercent = 0.0f;
bool btcDayChangePositive = true;
bool btcDayDataReady = false;
unsigned long lastBtcChartDraw = 0;
const unsigned long btcChartDrawInterval = 1000;

// UI State Machine
enum ScreenState { SCREEN_TIME, SCREEN_CRYPTO, SCREEN_BTC_DAY, SCREEN_KLIPPER };
enum WeatherVisual {
  WEATHER_VISUAL_UNKNOWN,
  WEATHER_VISUAL_CLEAR,
  WEATHER_VISUAL_PARTLY,
  WEATHER_VISUAL_CLOUD,
  WEATHER_VISUAL_RAIN,
  WEATHER_VISUAL_SNOW,
  WEATHER_VISUAL_FOG,
  WEATHER_VISUAL_THUNDER
};
