tome9111991/ESP32-S3_Project/ESP32-8048S043C/KlipperCryptoWeatherPanel/KlipperCryptoWeatherPanel.ino
unsigned long currentScreenInterval() {
  return currentScreen == SCREEN_TIME ? timeScreenInterval : defaultScreenInterval;
}

void setup() {
  Serial.begin(115200);
  delay(200);
  printBootDiagnostics();

  dataMutex = xSemaphoreCreateMutex();
  if (dataMutex == NULL) {
    Serial.println("Mutex Init fehlgeschlagen!");
    while (true) {
      delay(1000);
    }
  }

  networkMutex = xSemaphoreCreateMutex();
  if (networkMutex == NULL) {
    Serial.println("Network Mutex Init fehlgeschlagen!");
    while (true) {
      delay(1000);
    }
  }

  if (!initBtcStorage()) {
    Serial.println("BTC Speicher Init fehlgeschlagen!");
    while (true) {
      delay(1000);
    }
  }

  if (!initBoardDisplay()) {
    Serial.println("ESP32-8048S043C Display Init fehlgeschlagen!");
    while (true) {
      delay(1000);
    }
  }
  setDisplayBrightness(dayBrightness);
  printDisplayDiagnostics();

  initLvglDisplay();
  initTouchInput();
  createUi();
  lv_timer_handler();

  switchScreen(SCREEN_TIME);
  lastScreenSwitch = millis();

  beginWiFi();

  configureTimeOnce();

  BaseType_t fetchTaskCreated = xTaskCreatePinnedToCore(
    fetchDataTask,
    "FetchData",
    fetchTaskStackSize,
    NULL,
    fetchTaskPriority,
    &fetchTaskHandle,
    fetchTaskCore
  );
  if (fetchTaskCreated != pdPASS) {
    Serial.println("FetchData Task Init fehlgeschlagen!");
  } else {
    Serial.printf("FetchData Task gestartet: Core %d, Prio %u\n", (int)fetchTaskCore, (unsigned)fetchTaskPriority);
  }
}

void loop() {
  updateWifiState();
  handleTouchInput();

  unsigned long now = millis();
  bool popupMenuOpen = isPopupMenuOpen();
  if (!popupMenuOpen && now - lastUiRefresh >= uiRefreshInterval) {
    lastUiRefresh = now;
    refreshUi();
  }

  if (now - lastBrightnessRefresh >= brightnessRefreshInterval) {
    lastBrightnessRefresh = now;
    updateBrightnessBySun();
  }

  if (now - lastHealthLog >= healthLogInterval) {
    lastHealthLog = now;
    printRuntimeHealth();
  }

  if (!popupMenuOpen && currentScreen == SCREEN_KLIPPER && !isKlipperScreenAvailable()) {
    lastScreenSwitch = now;
    switchScreen(nextScreenState(currentScreen));
  }

  if (!popupMenuOpen && now - lastScreenSwitch > currentScreenInterval()) {
    lastScreenSwitch = now;
    switchScreen(nextScreenState(currentScreen));
  }

  lv_timer_handler();
  if (
    !popupMenuOpen &&
    currentScreen == SCREEN_BTC_DAY &&
    now - lastScreenSwitch >= screenSwitchSettleInterval &&
    now - lastBtcChartDraw >= btcChartDrawInterval
  ) {
    lastBtcChartDraw = now;
    drawBtcDayChart();
  }
  delay(5);
}
